name: "mnist_onnx"
platform: "onnxruntime_onnx"
input: [
    {
      name: "Input3"
      data_type: TYPE_FP32
      dims: [
        1,
        1,
        28,
        28
      ]
    }
]
output: [
    {
      name: "Plus214_Output_0"
      data_type: TYPE_FP32
      dims: [
        1,
        10
      ]
      label_filename: "labels.txt"
    }
]