name: "ensemble_model"
platform: "ensemble"
input [
  {
    name: "ensemble_input0"
    data_type: TYPE_FP32
    dims: [ 4 ]
  }
]
input [
  {
    name: "ensemble_input1"
    data_type: TYPE_FP32
    dims: [ 4 ]
  }
]
output [
  {
    name: "ensemble_output0"
    data_type: TYPE_FP32
    dims: [ 4 ]
  }
]
output [
  {
    name: "ensemble_output1"
    data_type: TYPE_FP32
    dims: [ 4 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "add_sub"
      model_version: -1
      input_map {
        key: "INPUT0"
        value: "ensemble_input0"
      },
      input_map {
        key: "INPUT1"
        value: "ensemble_input1"
      }
      output_map {
        key: "OUTPUT0"
        value: "mid0"
      },
      output_map {
        key: "OUTPUT1"
        value: "mid1"
      }
    },
    {
      model_name: "add_sub"
      model_version: -1
      input_map {
        key: "INPUT0"
        value: "mid0"
      },
      input_map {
        key: "INPUT1"
        value: "mid1"
      }
      output_map {
        key: "OUTPUT0"
        value: "ensemble_output0"
      },
      output_map {
        key: "OUTPUT1"
        value: "ensemble_output1"
      }
    }
  ]
}
