name: "ensemble_model"
platform: "ensemble"
input [
  {
    name: "ensemble_input0"
    data_type: TYPE_FP32
    dims: [
        1,
        1,
        28,
        28
    ]
  }
]
output [
  {
    name: "ensemble_output0"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "mnist_onnx"
      model_version: -1
      input_map {
        key: "Input3"
        value: "ensemble_input0"
      },
      output_map {
        key: "Plus214_Output_0"
        value: "mnist_output0"
      },
    },
    {
      model_name: "postprocess"
      model_version: -1
      input_map {
        key: "INPUT0"
        value: "mnist_output0"
      },
      output_map {
        key: "OUTPUT0"
        value: "ensemble_output0"
      },
    }
  ]
}
